## Object oriented programing

In [1]:
a = 43.4

In [2]:
print(type(a))

<class 'float'>

In [3]:
e = {
    "emp_id": [101, 102, 103],
    "name": ["Sarthak", "Raman", "Aditi"],
    "salary": [20000, 12000, 15000],
    "dept": ["HR", "Purchase", "Sales"],
}
type(e)

dict

In [4]:
import pandas as pd

df = pd.DataFrame(e)
df

   emp_id     name  salary      dept
0     101  Sarthak   20000        HR
1     102    Raman   12000  Purchase
2     103    Aditi   15000     Sales

In [5]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

### Attributes in dataframe
1. shape
2. dtypes
3. columns
4. index
5. values

In [6]:
df.shape

(3, 4)

In [7]:
df.columns

Index(['emp_id', 'name', 'salary', 'dept'], dtype='object')

In [8]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [9]:
df.values

array([[101, 'Sarthak', 20000, 'HR'],
       [102, 'Raman', 12000, 'Purchase'],
       [103, 'Aditi', 15000, 'Sales']], dtype=object)

In [10]:
df.dtypes

emp_id     int64
name      object
salary     int64
dept      object
dtype: object

### Functionalities of dataframe
1. info()
2. sort_values()
3. group_by()
4. agg()

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   emp_id  3 non-null      int64
 1   name    3 non-null      object
 2   salary  3 non-null      int64
 3   dept    3 non-null      object
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [12]:
df.sort_values(by="name")

   emp_id     name  salary      dept
2     103    Aditi   15000     Sales
1     102    Raman   12000  Purchase
0     101  Sarthak   20000        HR

### Create a user defined class for storing person information

In [13]:
class Person:

    def __init__(self, name, age, gender, occupation):
        self.name = name
        self.age = age
        self.gender = gender
        self.occupation = occupation

    def intro(self):
        print(f"My name is {self.name}")
        print(f"I am {self.age} years old.")
        print(f"I am a {self.gender}")
        print(f"I work as a {self.occupation}")

In [14]:
p1 = Person(name="Sarthak", age=32, gender="male", occupation="HR")
print(p1)

<__main__.Person object at 0x000001A5FF92E6C0>

In [15]:
p1.name

'Sarthak'

In [16]:
p1.age

32

In [17]:
p1.gender

'male'

In [18]:
p1.occupation

'HR'

In [19]:
# Intro is a function of class Person so () shold be used in end
p1.intro()

My name is Sarthak
I am 32 years old.
I am a male
I work as a HR

In [20]:
### Incorrect input can be provided by a user

In [21]:
p3 = Person(name=23, age="Raman", gender=21.45, occupation=False)
type(p3)

__main__.Person

In [22]:
p3.intro()

My name is 23
I am Raman years old.
I am a 21.45
I work as a False

##

### Working with Dataclasses

In [23]:
from dataclasses import dataclass
from typing import Literal

In [24]:
@dataclass
class Person2:
    name: str
    age: int
    gender: Literal["male", "female"]
    occupation: str
    married: bool

    def talk(self):
        print(f"My name is {self.name}")
        print(f"I am {self.age} years old")
        print(f"I am {self.gender}")
        print(f"I work as a {self.occupation}")
        print(f"Married : {self.married}")

In [25]:
p3 = Person2(name="Raman", age=28, gender="male", occupation="Engg.", married=True)

In [26]:
p3.talk()

My name is Raman
I am 28 years old
I am male
I work as a Engg.
Married : True

In [27]:
p4 = Person2(
    name="Priya", age=33, gender="female", occupation="Purchase", married=False
)

In [28]:
p4.talk()

My name is Priya
I am 33 years old
I am female
I work as a Purchase
Married : False